# Titanic Problem

## Load the data

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("./train.csv")

In [3]:
orig_df = df

In [4]:
df.head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C

In [5]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

## Remove some columns

In [6]:
del df['Cabin']

In [7]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [8]:
del df['Ticket']

In [9]:
del df['Embarked']

In [10]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500

In [11]:
df['IsFemale'] = df['Sex'].map({'female': 1, 'male': 0})

In [12]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,IsFemale
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,0

In [13]:
del df['Sex']

In [14]:
del df['PassengerId']

In [15]:
df.head(5)

,Survived,Pclass,Name,Age,SibSp,Parch,Fare,IsFemale
0,0,3,"Braund, Mr. Owen Harris",22.0,1,0,7.2500,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,71.2833,1
2,1,3,"Heikkinen, Miss. Laina",26.0,0,0,7.9250,1
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,53.1000,1
4,0,3,"Allen, Mr. William Henry",35.0,0,0,8.0500,0

In [16]:
del df['Name']

In [17]:
df.head(5)

   Survived  Pclass   Age  SibSp  Parch     Fare  IsFemale
0         0       3  22.0      1      0   7.2500         0
1         1       1  38.0      1      0  71.2833         1
2         1       3  26.0      0      0   7.9250         1
3         1       1  35.0      1      0  53.1000         1
4         0       3  35.0      0      0   8.0500         0

In [18]:
del df['Pclass']

## Remove rows with missing data

In [37]:
df_noNaAges = df.dropna(subset=['Age'])

In [38]:
df_noNaAges['Age'].isnull().values.any()

False

In [39]:
df_noNaAges['SibSp'].isnull().values.any()

False

In [40]:
df_noNaAges['Parch'].isnull().values.any()

False

In [41]:
df_noNaAges['Fare'].isnull().values.any()

False

In [42]:
df_noNaAges['IsFemale'].isnull().values.any()

False

## Train the model

In [43]:
feature_col_names = ['Age', 'SibSp', 'Parch', 'Fare', 'IsFemale']
predicted_class_name = ['Survived']

In [44]:
X = df_noNaAges[feature_col_names].values
Y = df_noNaAges[predicted_class_name].values

In [46]:
from sklearn.naive_bayes import GaussianNB

nb_model = GaussianNB()

nb_model.fit(X, Y.ravel())

GaussianNB(priors=None)

## Test model performance

#### Training data

In [47]:
nb_predict_train = nb_model.predict(X)

from sklearn import metrics

metrics.accuracy_score(Y, nb_predict_train)

0.78851540616246496

In [52]:
print(metrics.confusion_matrix(Y, nb_predict_train))

[[363  61]
 [ 90 200]]

In [54]:
print(metrics.classification_report(Y, nb_predict_train))
print("")

             precision    recall  f1-score   support

          0       0.80      0.86      0.83       424
          1       0.77      0.69      0.73       290

avg / total       0.79      0.79      0.79       714